import requests
import tqdm
import json
import pprint
from Utils.paths import *

wordList = ['汆', '穴', '系上', '洛丽塔', '宫颈', '腹痛', '穿衣', '棉袄', '当仁不让', '半小时', '铺于', '嘉年华',
            '碾碎', '汪峰', '更富', '胰岛素', '瘦身', '章子怡', '捷径', '樟脑', '438', '换作', '奇经八脉', '籽',
            '毋庸置疑', '睡够', '浴桶', '孤傲', '现出数以万计', '山药', '生物钟', '倾国倾城', '脸型', '肾虚', '贵贱',
            '韭菜', '根部', '高圆圆', '蝉连', '儿别', '80', '踩一踩', '饥饿', '雪纺', '排出', '脂脘', '经络',
            '我不喜欢', '浸液', '肌群', '思洲要睡觉了', '很潮', '据悉', '清纯', '大不一样', '148', '上床', '旧旧',
            '叠合', '童颜', '喇叭裤', '有多量', '睡太高', '干脆', '借助于', '血脉', '230', '腮红', '金姐', '双下巴',
            '搔首弄姿', '痒痒', '肝脏', '得花', '腰部', '精力不济', '西柚', '曝光率', '本想', '糖水', '阴道炎', '香氛',
            '环扣', '千金小姐', '散热', '对美', '歇业', '肾气', '足踝', '整背', '淋巴', '宋佳', '鸡脚', '士力架', '果',
            '粉刺', '吃枣', '施以', '率正', '西洋参', '有夜', '衬托出', '电竞', '靴', '偏旁', '超低', '通便', '领子',
            '龙虾', '红红火火', '棕', '套衫', '护理学', '褐斑', '两肘', '隆鼻', '流汗', '香精', '黑麦', '气喘吁吁',
            '不想要', '提包', '酝酿', '营业额', '鸡毛蒜皮', '金银花', '贴身', '口渴', '嫁', '可圈可点', '伪装',
            '康复科', '坠腹', '悬垂', '松弛', '木瓜', '外伤', '提早', '点穴', '脾区', '那款', '形外', '修疤', '崔振旭',
            '赤裸', '养眼', '通通', '代言', '再练', '乳腺癌', '而外', '款型', '腰酸', '纯情', '提个醒', '汗淋淋',
            '小朋友的脸蛋', '风热', '扮', '金秋', '加重', '1015', '宋佳因', '段距离', '吐故纳新', '紧俏', '电视广告',
            '挤', '渐丰', '或用', '腕表', '出汗', '不清', '前短后长', '果胶', '腰围', '香料', '由下', '常吃', '白歆惠',
            '吃不消', '血脂', '瘦素', '祛味', '绞丝', '昏昏欲睡', '好前', '两栖', '皮革制品', '媚眼', '糖尿病', '多金',
            '黑花', '对比色', '五脏六腑', '睡房', '帷幕', '气血', '傲人', '不育', '泡水', '冰水', '衬衣', '粉全',
            '面膜', '高领', '配有', '肚子', '水土不服', '转头', '咽喉', '奶茶', '妖姬', '困了', '展露', '豆浆', '明目',
            '减分', '搭长款', '心强', '咳痰', '爷爷', '阴道口', '交友', '脱离实际', '编辰晨', '东方人', '你在开玩笑',
            '柚子', '玉片', '海苔', '干蒸', '松饼', '220', '偷懒', '元次', '多因', '俯卧', '风行', '小窍门', '肩部',
            '双花', '下过', '几公斤', '蓬松', '洗净', '无袖', '医学科', '澡', '限量', '330', '丰满', '桃子', '抗菌',
            '热裤', '支招', '微红微', '荠菜', '无光泽', '精神紧张', '胡桃夹子', '直立', '窈窕', '刺绣', '尿痛', '荔枝',
            '鲜儿', '同龄人', '抗氧化', '赘肉', '心里美', '店数', ';', '唇', '痤等', '鸡汤', '女人味', '煞', '万圣',
            '发胀', '卧榻', '称得上', '迷你裙', '品致', '高挑', '卸载', '浑身', '以色', '春夏', '经常思过', '一种称呼',
            '谷类', '拓什说', '寒气', '过膝', '中间部分', '上半身', '费以', '映入眼帘', '咖色', '减肥餐', '铆钉', '90',
            '宜家', '凉快', '亚健康', '沙盒', '强效', '买辣条吃', '姑娘', '少穿', '多尿', '润泽', '推杯', '害死',
            '实体店', '之气', '直肠', '束出', '霍建华', '辣妈', '本症', '吃完饭', '鼻中柱', '细细', '剥皮', '强森',
            '亏', '骨盆', '静息', '发病率', '中秋節', '亲热', '浓茶', '点前', '撒上', '拜年', '真不知道', '勾不起',
            '油腻', '阿瘦', '喝点', '温煦', '红润', '墓志铭', '心理卫生', '含糖量', '不失', '棒针', '驼色', '同色系',
            '快乐开会', '血热', '排便', '范冰冰', '负担过重', '袖衫', '重者', '好美', '随处可见', '胃酸', '臭女人',
            '裤配', '眼部', '莲子心', '拧', '厚底', '肚脐', '100', '2006', '星爷', '内长', '小便', '朱朝阳', '500',
            '250', '乳沟', '热流', '百脉', '子宫颈', '炙手可热', '米字', '蕨菜', '膻中', '扎眼', '板栗', '帅气',
            '松糕鞋', '清肝', '很多毛', '没准儿', '伟哥', '穴则', '挥一挥', '美美', '最烦', '尖', '慢性病', '甘露',
            '蚀', '妖', '风寒', '样', '好比', '旧人', '醒', '挤破', '保证金', '印花', '细磨', '嘶哑', '精子库', '很火',
            '挡风', '该该', '捂汗', '配件', '汇报工作', '剩饭', '浴剂', '完形', '整晚', '乍看之下', '错乱', '香薰',
            '酸痛', '催眠', '半裙', '短裤', '骨子里', '胖虎', '高价位', '霹雳娇娃', '扬长避短', '起死回生', '香艳',
            '披肩', '土气', '糖原', '宾客', '滋', '杜鹃', '早泄', '合身', '虽说', '鼻内', '整形手术', '织', '煎',
            '汤药', '潜移默化', '现身说法', '柳岩', '莫名其妙', '先睡', '核黄素', '背后一刀', '百分百', '牛筋', '切除',
            '声名在外', '珍珠项链', '半夏', '四肢', '甲状腺素', '芦荟', '后作', '脱衣舞娘', '很起', '聚', '179',
            '红黄绿', '80000', '肿块', '初练者', '宾夕法尼亚', '胸部', '呕吐', '女性美', '并拢', '含糖', '紧张状态',
            '淡味', '大肠', '格子裙', '结了婚', '般向', '霓虹', '愣', '派头', '188', '腰腹部', '颜色很明显', '装扮',
            '暖冬', '吞', '趁', '套餐', '炖煮', '元穴', '窑鸡', '霸', '后辈', '小美裙', '加身', '稠厚', '鲜', '应酬',
            '弹力', '基础代谢率', '血症', '养颜', '清雅', '紧实', '玉女', '毫升', '醋', '过年借钱', '颗青', '长裙',
            '哈根达斯', '宽宽的', '脱掉', '解毒', '面色', '静卧', '营养成分', '剧烈运动', '略长', '祛风', '推拿',
            '财会', '百褶裙', '葫芦', '体征', '黑长款', '经期', '迷魂', '旋覆花', '失调', '地溝油', '配上', '暗黄',
            '三点', '畅快', '微循环', '今天换个人来', '常坐', '林光常', '背道而驰', '调养', '慢压', '一坐',
            '电脑里有这个', '雅观', '礼帽', '泡澡', '忙来忙去', '畏寒', '挤出来', '呼之欲出', '代谢物', '平贴', '碳酸',
            '病症', '麦肯', '渡假', '黑莓', '发花', '远看', '宫颈炎', '里焯', '进餐', '苦恼', '血糖', '柳钉式',
            '血流量', '装束', '潇洒', '闯过', '樱桃', '暖', '爱美', '推陈出新', '剧中', '于二阴', '那排', '收形',
            '慢性', '增生', '努力毒姐', '这码', '减肥法', '不愈', '糙米', '高帮', '答对', '马兰头', '波澜', '落魄',
            '简简单单', '白衬衫', '妩媚', '沙拉酱', '肥胖', '皱褶', '血管', '动不动', '祛除', '斜襟', '单肩', '精品',
            '异域', '蛋清', '舒压', '获赠', '橘色', '美容院', '内敛', '男人装', '67', '疲劳过度', '啃', '埋下', '蠢蠢',
            '人人都有一份', '光亮', '尿量', '水对', '层次分明', '阿笠博士', '泥', '48', '甲亢', '扣', '饰', '苗条身材',
            '口一', '沸水', '短靴', '现成', '时先用', '精生髓', '针', '消化道', '铺垫', '吃生', '脱拉库', '轻者',
            '龙井茶', '同款', '伤及', '病状', '盛誉', '娃娃', '才刚', '水肿', '崇文门', '鞋业', '节食', '外阴',
            '冠心病', '鼻部', '绿茶', '浴区', '给你撅折了', '重机', '哦', '秀', '希瑟', '横', '发胖', '浆液', '饮',
            '用鲜', '尽显', '怪', '高街', '欲盖弥彰', '查杀', '睡前', '短发', '405060', '过命', '滚滚滚', '照看',
            '爽口', '轮流转', '切口', '剩女', '柳镇饰', '率性', '卷边', '排毒', '胆固醇', '全麦', '需先', '锅中焯',
            '揉', '调味剂', '床上用品', '罗荣岳', '进食', '晚一点', '轻揉', '相差近', '香疯了', '42', '嫁入', '赤兔马',
            '干涩', '严格说来', '下腹部', '圆圆', '粗鄙', '何尝', '童鞋', '很糟', '招数', '贵妇', '蜻蜓点水',
            '拖泥带水', '渴求', '臀部', '脓性', '老百姓', '雌激素', '满屋', '你行你上', '不在地球的', '我有的', '廉价',
            '插座', '正以', '热水澡', '酵素', '猪蹄', '壮阳药', '性爱', '熟女', '晦暗', '行天下', '而素', '老年斑',
            '易留', '人靠', '酶类', '出太阳了', '以致', '柔弱', '叶酸', '滑嫩', '胡椒', '谬论', '饱腹', '里存',
            '中几大', '红豆女', '无穷大', '寸', '总要', '含蓄', '忽', '新风尚', '靡', '喝汤', '处女', '站街女', '发热',
            '白皙', '更美型', '结实', '体虚', '共性', '主二便', '啥也看不见', '纤细', '松紧度', '胰岛', '3890', '三元',
            '红萝卜', '话筒', '显胖', '大牌', '秋冬', '精华', '我擦', '体温', '去皮', '水柏枝', '毛线', '植物种子',
            '孕激素', '无光', '细腰', '柔情', '胸转', '份量', '等面试', '废物', '家小', '嘿哈', '温肠', '致癌物质',
            '去核', '挖空心思', '按压', '娇嫩', '将梨桃', '瓜子脸', '压住', '温热', '推油', '根肋骨', '容颜', '往上提',
            '凉鞋', '俗艳', '单品', '梨', '软', '轻重', '柠檬汁', '亦然', '范儿', '隐疾', '浴', '乳糖', '做个',
            '月经周期', '饭局', '暗算', '高粱', '一针一线', '上衣', '螺旋状', '弄', '肾精', '穿脱', '烦人', '手镯',
            '前襟', '杠铃', '底裤', '中原中也', '一字掰', '宿便', '胸线', '旺季', '嗒', '百丽系', '参考价格', '准妈妈',
            '迷你岛', '红色瓶子', '睡了', '花甲之年', '整身', '低脂', '蠕动', '裁剪', '鼻腔', '病理性', '马甲',
            '肥胖者', '缴', '小麦粉', '闯关东', '抑止', '打气', '变身', '色彩鲜艳', '惨淡', '人常因', '太硬',
            '侯门深似海', '性幻想', '毛巾布', '紧致', '情侣装', '大出风头', '曼妙', '速速', '八款', '资历', '推心置腹',
            '阴部', '正正', '脱衣服', '鞋', '啾啾', '各转', '背较', '格纹', '低腰', '提亮', '制鞋', '尝尽', '不大不小',
            '熟后', '时间差', '醒过来', '稍加', '女强人', '前宜', '挥发', '炒', '今季', '硫化物', '卫衣', '内伤',
            '陈皮', '刻板偏见', '生长激素', '右侧', '辫', '盹', '指压法', '口红', '熬夜', '穿法', '大红色', '动一动',
            '小腹', '淑女', '12224', '红烧', '献身', '洗手液', '饥渴', '课业', '脚踝', '晚上能看到', '梨桃', '11517',
            '跑车', '舍特', '泳装', '宜吃酸', '药力', '套上', '冷遇', '卡路里', '问诊', '无可比拟', '恰似', '谨记',
            '撰稿人', '丝织品', '一丁点儿', '送葬', '瘦腿', '肺泡', '郑东学', '翘', '暗睡', '敞开', '半杯', '腺体',
            '女明星', '热敷', '高价', '爱马仕', '轮廓', '健胃', '肝肾', '下腹', '花式', '要面子', '异物', '玉鼎里',
            '姐翘', '清淡', '活血', '丝质', '美国斯坦福大学', '变软', '垂坠感', '麻子', '粘性', '吕育', '润肠', '全日',
            '娃娃脸', '疤', '何去何从', '鸡皮', '拉锁', '外皮', '一推', '黑胡椒', '说实话', '捣碎', '二层', '一波',
            '颚裂', '里少', '重温', '春夏季', '髓海', '玉臂', '束上', '男士', '米饭', '忘书里', '保养品', '烟装',
            '调经', '贴近生活', '胸大', '不孕', '麻黄', '生育能力', '大宝贝', '内气', '乳腺', '消化吸收', '皇仕',
            '鲜奶', '倘若', '解剖', '补肾', '疗程', '之恋', '块物', '好似', '无端', '大吃大喝', '帽', '嗓子', '火山石',
            '腹肌', '熟', '收紧', '会香', '髓', '起士', '良好环境', '消化系统', '爆米花', '魅惑', '蹭', '技师', '严明',
            '色盲症', '前倾', '杜蕾斯伴侣', '下半身', '下摆', '长到', '光鲜', '糖蜜', '长痘痘', '老头子吹牛皮',
            '好不容易', '陈准', '薄纱', '霜时', '汤勺', '肝区', '老铁', '胡萝卜素', '显瘦', '花格', '稀薄', '连衣',
            '少女时代', '幻境', '灯罩', '系扣', '事不分', '平躺', '富氧', '嫩绿', '掉头发', '胸有', '辈份', '下垂',
            '立体感', '一两个', '任凭', '俨然', '来配', '白带', '忽明忽暗', '手袋', '吸收量', '西部世界', '顺势',
            '尿频', '对症', '红艳', '美眉', '颈部', '枸杞子', '比目鱼', '收身', '弹珠', '涂抹', '丰胸', '低胸', '弗尔',
            '傻逼', '坂本', '抗癌', '试一试', '30000', '导语', '水土', '盛夏', '箱', '沧桑感', '霜', '老爷车',
            '风月无边', '单靠', '穴道', '瘀', '脸色', '毫无疑问', '腹胀', '怕冷', '短外套', '小肚腩', '洋葱', '小火',
            '赤壁', '搭', '过季', '180', '瘙痒', '别说', '主打', '调拌', '短裙', '鼓出', '流行时尚', '638', '陈词',
            '选准', '单笔', '浴汤', '腰膝', '吃亏', '静如处子', '再挤', '防水', '发色', '坐姿', '典著', '闭锁', '内膜',
            '遮住', '豆渣', '拉裤兜', '非手术', '高水润', '舒爽', '震撼我', '光亮度', '按摩', '房内', '搂抱',
            '北京服装学院', '看准', '致癌', '柔媚', '倒入', '毕露', '如甲硝', '三哥', '桑白皮', '香菜', '密密麻麻',
            '宛若', '肛裂', '脏器', '小睡', '池成', '稀释', '柳丁', '小辫', '雪纺裙', '纯羊毛', '顶灯', '前所未见',
            '红裙', '酸涩', '晚睡', '敲开', '独生子女', '胃病', '安神', '痛感', '水煮蛋', '耳聋', '垃圾分类',
            '阴差阳错', '紧身', '背黑锅', '素英', '892', '毛绒', '生津润', '秋名山', '花钱买', '切块', '胀痛', '速效',
            '藏药', '潮品', '装苑', '不难看出', '星火传递', '西服', '海信', '弯曲', '牙', '护养', '根治', '多梦',
            '教资', '大组', '1200', '一百元', '费口舌', '点评', '毛孔', '洗完', '838', '折射', '谢菲尔德', '肝炎',
            '伸舌头', '李立前', '韩雪出', '阻塞', '玉秀', '旌神', '干练', '焯', '马达', '履历', '阴囊', '色系', '肝郁',
            '原发性', '消消乐', '颓废', '遮掩', '最会', '咖啡色', '中浸', '抗衰老', '倒水', '流血', '489', '那话儿',
            '烫', '挪用', '淋浴', '买买买', '粥', '鱼排', '烫伤', '骑装', '生食', '剥去', '盘点', '减脂', '横行霸道',
            '张韶涵', '穴位', '上身', '肠', '傻', '刮上', '不让看', '哇哇哇哇', '两只手', '!', '王彤', '萝莉', '汤锅',
            '冬令', '我懂你', '勺', '前侧', '胀大', '我太胖了', '悄悄的', '帆布包', '舒舒服服', '那儿', '橙汁', '衣橱',
            '影坛', '豆腐干', '好多地方', '乳液', '红薯', '干瘪', '略显', '摄取', '多吃含', '棉质', '毒素', '隐藏式',
            '领', '端茶', '发落', '撩开', '败给', '基础油', '吝啬', '三生三世', '昨天打包有的', '活脱脱', '颜面', '遮',
            '款款', '分泌物', '人未到', '硝', '主任医师', '消化不良', '夹克', '燕麦片', '打响指', '久之', '粗粮', '捂',
            '凌乱', '程序猿', '长裤', '腰线', '旧衣服', '稍息', '画圆', '可先', '骑单车', '餐肉', '叶宜', '75', '图腾',
            '瘀斑', '宜吃', '磨白', '好几岁', '吹风', '打盹', '水晶球', '所养', '单价', '红灰', '3050', '388', '修护',
            '两手', '而定', '让你能', '顺带', '气短', '甜腻腻', '腰间', '美腿', '点拨', '糖耐量', '弯腰', '精制',
            '起跑', '粗大', '没完没了', '烤', '裤', '劳损', '文胸', '加点', '千册', '乳黄色', '炖锅', '腰肢',
            '午餐时间', '血尿', '好鞋', '从廓', '大号', '无痕', '时装', '短款', '油', '黏液', '麦子', '欧令奋',
            '萧峰的反义词', '盏', '长幼有序', '放电', '款长款', '悲愤', '松下', '敢', '不折不扣', '老态', '伤胃',
            '同饮', '乳头', '小衫', '大便', '腹部', '蒙面', '电话铃', '嗯嗯', '露脐装', '俏皮', '木质', '姬',
            '整形外科', '打底', '小编', '仰卧', '推压', '夜尿一', '经脉', '吸收率', '增肌强', '接踵而来', '野菜',
            '为量', '大团圆', '残渣', '涂敷', '静脉血', '绒球', '快到', '45', '烟熏', '甚多', '妊娠', '清脂素',
            '墨守成规', '大胸', '巴格', '洗练', '久病', '草绿', '米色', '爱出', '褶皱', '中火', '肾脏', '肾藏',
            '青春痘', '搅匀', '裙裙', '瘀血', '骊', '挤挤', '唇色', '针织衫', '哮喘', '拾级而上', '鬼怪', '糠麸',
            '用过', '瓜葛', '透视装', '怡然自得', '豹纹', '角膜', '配饰', '朱古力', '内裤', '男女老少', '布丁',
            '写字楼', '眼袋', '消积', '连身', '吃奥尔良烤翅', '圆领', '黯淡', '稚嫩', '敷脸', '烧开', '毛线衣',
            '药用价值', '肠胃', '读者文摘', '天劫', '总缺', '忽胖', '四个字', '吐司', '恒久不变', '柿饼', '天野雪辉',
            '整年', '编者按', '浮华', '衣品', '款来', '滴虫', '咧嘴', '正有', '秀丽', '肿痛', '秉承', '脚后跟', '黄豆',
            '色拉', '去跳舞', '加入适量', '梁洛施', '耳坠', '寒湿', '烂漫', '瘦', '血水', '催人老', '食少少死唔去',
            '皮草', '变性人', '陶子', '无规律', '我包里有的', '遮盖', '休闲装', '肾', '记再', '汤老师在哪儿', '斜',
            '血液循环', '气死', '黑裙', '窦道', '榨成', '新新类', '姿色', '啤酒肚', '艳遇', '哇哦', '花格子', '枯黄',
            '糖浆', '滥竽充数的', '整形术', '得了就得难受', '能比', '胃疼', '下肢', '天高', '中午饭', '穿不出',
            '甄嬛传', '2003', '臭味', '牙龈', '问卷调查', '十三门徒', '腰扎', '灰', '海鲜类', '吃饱', '买点', '性感',
            '重重的打击', '为之一变', '待放', '销魂', '小蛮', '动画城', '更显', '汞', '胸闷', '我在学游泳', '误区',
            '气滞', '系带', '国色', '卧少气', '睡眠不足', '补氧可', '未改', '乏力', '媲美', '官渡之战', '累并快乐',
            '狗血', '静脉', '携氧', '直奔', '长出', '烂', '东方仗助', '南水北', '白白软软', '远远不够', '娇气', '瘦腰',
            '汤煲', '名利双收', '荞麦', '药液', '侦探', '夫妻俩', '瘦体素', '再记', '类黄酮', '呀', '燕麦', '各握',
            '银魂', '隆起', '水乳交融', '脱下', '痔疮', '招摇', '胰腺', '欠', '导读', '肠道', '哔哔', '腿部', '果蔬',
            '大红大紫', '锌', '青睐', '嘴鞋', '低腰裤', '吊带衫', '退堂鼓', '闻起来', '炖', '打个比方', '金莲花',
            '黑芝麻', '健身法', '伞裙', '泡沫状', '带牛', '肢冷', '国外传来的', '天枢', '内开', '罩衫', '进补', '点睛',
            '励志', '开门红', '闪闪的', '淡不渴', '雷厉风行', '伺花', '天起', '第三天', '飙升', '荷尔蒙', '伸直',
            '收腰', '两腿', '热石', '杂交', '绿箭口香糖', '焖', '崔', '车展', '刮手', '杏仁', '仔裤', '秉持',
            '反反复复', '量多', '娴', '牙肉', '无所不用其极', '热水', '划船不用桨', '台北讯', '悬', '色小', '凉拌',
            '刊文', '下颚', '萝卜', '继发', '短浅', '患感冒', '涨', '烟酸', '宜', '多得多', '蓝莓', '柠檬黄', '餐',
            '叶中', '定期检查', '大笨蛋', '切丁', '嚼', '屑', '颈椎', '利尿', '弗洛伦斯', '挺起', '1952', '张柏芝',
            '腿软', '出错率', '娜拉', '黑木耳', '双开门', '带鱼', '红毯', '老气', '汪梦', '蘑菇最讨厌的', '周杰伦歌曲',
            '消肿', '饭馆', '贵妇人', '英则', '大祸', '浸泡', '黏', '阴养颜', '情趣', '颏', '尿多', '日限', '肺气',
            '蓄积', '各一茶', '463', '沥干', '胸前', '排泄', '不老', '北服', '开水', '2530', '人体器官', '扮嫩', '诊治',
            '四下', '银灰色', '淋菌', '吊带裙', '养脏', '硬朗', '皮下', '火候', '始作俑者', '三角区', '痤替', '鼻柱',
            '一代新人', '睡足', '44', '干就完了', '红糖', '脑失', '尿道', '行之有效', '015', '羊哥', '开窍', '麻花',
            '配低', '素英离', '毛线帽', '小包', '盛满', '大热于', '帽衫', '鼓得', '浅色', '脱脂', '活灵活现', '口服液',
            '衰老', '888', '时尚女性', '葵花子', '过目不忘', '挤压', '通假字', '痘痘', '露富', '先到', '搭扣', '扩',
            '固醇', '皮脂腺', '尘土帽子', '讨人喜欢', '1976', '788', '滑精', '前后左右', '加温', '南丁格尔', '扑克牌',
            '严重者', '长款', '徐怀钰', '流苏', '疏通', '久坐', '裸露', '臀', '忽寒地', '汁', '随性', '周杰伦演唱会',
            '讲手', '敏感度', '鞋履', '刘晓庆', '粉红', '凹凸不平', '便装', '过劳死', '叶等', '拿手', '女星', '涩味',
            '裙', '爆发力', '呢子大衣', '赚', '泥水', '恰恰相反', '连帽', '学生服', '天旋地转', '买去吧', '眼花',
            '开流', '花色', '擂台', '无余', '拉伤', '水煮', '患', '东华大学', '灼痛', '伸', '羞涩', '；', '饱受',
            '伸懒腰', '冲淋', '超短', '坚挺', '经量', '豆腐脑', '会显', '代茶', '艳光四射', '更何况', '一脸',
            '心血管病', '打洞', '思洲圈地自萌', '懒言口', '吊儿郎当', '排气', '将光', '超龄', '两批', '支气管', '外穿',
            '不管怎么', '性交痛', '不懂事', '莴笋', '浮肿', '身子', '上显', '衣装', '苦瓜', '使劲', '恬静', '油脂',
            '320', '忽暖', '干蒸房', '游手好闲', '腰身', '草莓蛋糕', '圈儿', '补氧常', '1112', '下身', '滔滔不绝',
            '夜尿', '头戴', '搜刮', '全粒', '左手', '恶心', '像不像', '细嚼慢咽', '燕窝', '整形', '起雾了', '运动裤',
            '军绿色', '风尘', '摆摊', '不光', '横切', '含浑', '肌肤', '褶', '你经常做的事']


def get_access_token():
    """
    使用 API Key，Secret Key 获取access_token，替换下列示例中的应用API Key、应用Secret Key
    """
    AppID = 44592571
    ApiKey = 'tEUIklndR5n0EtmZBCTXGIMZ'
    SK = 'lUKitI49tkevMOiMl9NUIP6kpA7osNxN'

    url = f"https://aip.baidubce.com/oauth/2.0/token?grant_type=client_credentials&client_id={ApiKey}&client_secret={SK}"

    payload = json.dumps("")
    headers = {
        'Content-Type': 'application/json',
        'Accept': 'application/json'
    }

    response = requests.request("POST", url, headers=headers, data=payload)
    return response.json().get("access_token")


def main(word):
    # url = "https://aip.baidubce.com/rpc/2.0/ai_custom/v1/wenxinworkshop/chat/completions_pro?access_token=" + get_access_token()
    url = 'https://aip.baidubce.com/rpc/2.0/ai_custom/v1/wenxinworkshop/chat/eb-instant?access_token=' + get_access_token()
    payload = json.dumps({
        "messages": [
            {
                "role": "user",
                "content": f"""
                用'{word}'这个词语造一个25句子，要求如下：
                1.你只需要输出这25个句子就行
                2.句子不能重复，越多样化越好
                3.给你的词汇不能只在开头或者结尾出现，需要在句子中间出现
                """
            }
        ]
    })
    headers = {
        'Content-Type': 'application/json'
    }

    response = requests.request("POST", url, headers=headers, data=payload)
    with open(os.path.join(LLM_data_expand_path, "LLM_dataGenerate.txt"), "a", encoding='utf-8') as f:
        res = eval(response.text.replace("false", 'False').replace("true", 'True'))
        try:
            f.write(res['result'])
        except Exception as e:
            print(res)
            raise e
    # print(res['result'])


def Expand():
    res = []
    summaryDict = {}
    cnt = 0
    for i in tqdm.tqdm(wordList, desc='生成数据集增强文本中'):
        cnt += 1
        with open(os.path.join(LLM_data_expand_path, "LLM_dataGenerate.txt"), "r", encoding='utf-8') as f:
            cont = f.read()
            if cnt % 20 == 0:
                print(f"当前增强文本总长度：{len(cont.replace(' ', ''))}")
            if cont.count(str(i)) not in summaryDict:
                summaryDict[cont.count(str(i))] = 0
            summaryDict[cont.count(str(i))] += 1
            if cont.count(str(i)) >= 15:
                # print(f"词语:{i} 在已有增强文本中计数为:{cont.count(str(i))}，无需增强，跳过")
                res.append(int(cont.count(str(i))))
                continue
        main(i)
    print(sum(res) / len(res), min(res), max(res))
    pprint.pprint(summaryDict)