import requests
import tqdm
import json
import pprint

wordList = ['不败', '曼联', '6', '英超', '胜率', '70', '不给力', '深盘', '下盘', '不给力', '客场', '胜率', '英超',
            '平手', '正路', '四支', '舵手', '曼城', '丝袜', '墨镜', '热刺', '狼队', '足球彩票', '11092', '14', '初盘',
            '：', '战意', '鬼恐', '抛锚', '顾此失彼', '防冷', '新浪', '开心', '：', '09080', '胜负彩', '初盘', '预赛',
            '末轮', '临场', '任九小单', '敬请', '！', '01A', 'vs', '阿尔巴', '31', '02A', '丹麦队', 'vs', '31', '丹麦队',
            '本赛', '体能', '03B', 'vs', '3', '04B', '瑞士队', 'vs', '31', '客场', '2', '-', '2', '战平', '05C', 'vs',
            '31', '失去机会', '0', '-', '0', '闷', '战成', '战意', '主场优势', '足彩', '31', '06C', 'vs', '30', '沦落',
            '附加赛', '之虞', 'R9', '07D', 'vs', '0', '06', '年友赛', '客场', '0', '-', '4', '赢球', '足彩', '单选',
            '0', '08D', '德国队', 'vs', '芬兰队', '31', '本场', '德国队', '谢幕', '不容', '芬兰队', '搅局', '客场', '3',
            '-', '3', '战平', '够', '郁闷', '09D', 'vs30', '摘除', '鱼腩', '高帽', '预赛', '7', '2', '主客场', '连负',
            '鬼', '2', '-', '0', '轻取', '足彩', '0', '捧', '10F', 'vs', '0', '解盘', '：', '萨雷斯', '连胜', '克鲁',
            '塞罗', '不败', '01', '努曼', 'vs', '31', '努曼', '连败', '三轮', '2', '近获', '两连胜', '四轮', '1', '3',
            '不胜', '往绩', '努曼', '2', '2', '1', '负略', '足彩', '31', '02', '萨雷斯', 'vs', '韦斯卡', '3', '降班',
            '马萨雷斯', '季初', '两连败', '足彩', '单选', '3', '03', '埃尔切', 'vs', '阿尔巴', '塞特', '30', '埃尔切',
            '两连胜', '但近', '四轮', '1', '3', '不胜', '阿尔巴', '塞特', '1', '2', '不败', '客场', '1', '2', '不胜',
            '埃尔切', '4', '3', '3', '04', 'B', 'vs', '3', '升班马', 'B', '4', '2', '3', '连胜', '05', '罗纳', 'vs',
            '31', '上赛季', '两制', '战平', '足彩', '复选', '31', '06', '卡塔赫纳', 'vs', '戈纳', '3', '上赛季', '两制',
            '卡塔', '主客场', '双杀', '足彩', '单选', '3', '07', '塞尔塔', 'vs', '艾科坎', '13', '塞尔塔', '获五',
            '连胜', '季初', '负于', '塞维利', 'B', '升班马', '艾科坎', '3', '客场', '2', '1', '不胜', '08', '帕尔马斯',
            'vs', '贝蒂斯', '01', '帕尔马斯', '3', '3', '不败', '韧性', '贝蒂斯', '5', '1', '客场', '2', '1', '2',
            '客场', '2', '负堪', '克星', '足彩', '单选', '0', '复选', '01', '09', '博塔弗戈', 'vs', '帕尔梅', '1', '28',
            '轮积', '43', '分降', '第五名', '5', '9', '不败', '13', '平局', '为巴甲', '平局', '客场', '4', '8', '2',
            '韧性', '4', '6', '不败', '足彩', '单选', '1', '复选', '13', '10', '科林蒂安', 'vs', '戈亚尼', '31', '客场',
            '2', '2', '10', '本季', '科林蒂安', '客场', '1', '-', '3', '足彩', '复选', '31', '而策', '11', '克鲁',
            '塞罗', 'vs', '弗鲁米', '31', '往绩', '2', '2', '不分伯仲', '足彩', '31', '12', '戈伊', '亚斯', 'vs', '30',
            '戈伊', '亚斯', '六轮', '1', '2', '3', '取分', '积', '25', '分排', '业已', '降级', '3', '4', '7', '善战',
            '客场', '2', '4', '8', '软肋', '戈伊亚', '2', '1', '不败', '欧赔', '99', '保级', '足彩', '30', '两头', '13',
            '奥瓦', 'vs', '弗拉门', '30', '积', '33', '分排', '14', '卫冕冠军', '似有', '保级', '隐忧', '客场', '3',
            '4', '7', '奥瓦', '1', '客场', '2', '不败', '足彩', '30', '防客', '14', 'vs', '瓜拉尼', '3', '升班马', '1',
            '-', '1', '战平', '足彩', '3', '本期', '进球彩', '：', '2004888', '小刀', '解盘', '：', '豪取', '连胜',
            '新浪', '体育讯', '1', '、', '3VS', '鬼', '：', '31', '2', '、', '爱沙尼', 'VS', '波黑', '：', '0', '3', '、',
            'VS', '：', '0', '4', '、', 'VS', '：', '0', '5', '、', 'VS', '：', '30', '6', '、', 'VS', '阿塞拜', '；', '31',
            '鱼腩', '难料', '7', '、', 'VS', '：', '31', '8', '、', 'VS', '：', '30', '9', '、', '塞尔维', 'VS', '罗马尼',
            '：', '3', '10', '、', 'VS', '：', '10', '11', '、', 'VS', '：', '1', '12', '、', 'VS', '：', '31', '13', '、',
            '委内瑞', 'VS', '：', '30', '出线', '帅位', '14', '、', 'VS', '萨尔瓦', '：', '3', '小刀', '2', '258', '亿成',
            '彩民', '可买彩', '359', '双色球', '砸', '巨奖', '“', '砸', '”', '258', '巨奖', '撞', '一下', '258', '巨奖',
            '巨奖', '彩民', '：', '开心', '”', '彩民', '“', '大尉', '”', '“', '”', '立帖', '必出', '亿级', '”', '帖子',
            '“', '”', '应验', '楼主', '兑奖', '彩民', '4882', '心仪', '恶搞', '领奖', '8', '中奖', '“', '买栋', '”',
            '心仪', '：', '感谢', '开奖', '仁兄', '：', '接线员', '联系方式', '再三', '老妈', '报喜', '掐', '一下',
            '做梦', '：', '全身', '掐', '紫', '：', '睡不着', '安眠药', '难受', '：', '起得', '太早', '大骂', '奸商',
            '做假', '安眠药', '太早', '：', '傻笑', '领奖', '：', '半路', '下车', '改乘', '：', '夸奖', '开心', '昨天',
            '接电话', '：', '赔礼道歉', '心理医生', '奖票', '奖票', '缴税', '：', '缴', '976', '一声', '下巴', '脱臼',
            '询问', '：', '赶快', '闭上嘴', '下巴', '脱臼', '愈', '小雨', '：', '我取', '万枚', '数着', '3904', '存折',
            '：', '7', '乞丐', '：', '葛朗台', '：', '挂', '电话线', '：', '郑俊春', '杨静', 'FIFA', '拜仁', '贝里',
            '古斯塔', '沃两大', '门兴', '博胆', '本期', '博胆', '门兴', '季默特', '不胜', '追逃', '进利', '追逃',
            '堂兄弟', '涉案', '村官', '知情人', '杨海', '杨海', '杨寅均', '1988', '12', '18', '进利', '政审', '《',
            '都市快报', '》', '避限行', '车牌', '被查', '民警', '警觉', '10', '31', '8', '民警', '查获', '两辆车',
            '此案', '、', '海淀', '小偷', '行窃', '西瓜', '裸男', '吓', '傻眼', '本报记者', '赵杨', '通讯员', '高惠勇',
            '昨日', '吕某', '鼓东', '涉嫌', '故意伤害罪', '刑拘', '小偷', '掏出', '弹簧刀', '吓', '无惧', '冲', '上前',
            '小偷', '扭打', '吕某', '可籍', '震区', '探亲', 'T恤', '自首', '抢', '60', '上前', '抢到', '60', '牵挂',
            '回川', '探亲', '景某', '自首', '景某', '后悔莫及', '呆', '2', '景某', '自首', 'T恤', '自首', '”', '（',
            '俞志斌', '彭昊', '）', '误食', '邻家', '毒药', '获刑', '通讯员', '王春梅', '李燕', '胡志英', '徐某',
            '莒南县', '开坐', '法医鉴定', '小琳系', '氰化物', '”', '同仁医院', '砍续', '：', '疑似', '嫌犯', '曝', '砍',
            '楼梯', '那边', '大摇大摆', '警方正', '此案', '小伙', '吊扇', '叫停', '毅力', '【', '】', '山村', '养猪',
            '娃造', '嵩县', '旧县', '镇寺', '上村', '西沟', '“', '吊扇', '”', '吴中', '元笑', '想造', '拮据', '“',
            '黑帮', '”', '上安', '吊扇', '底座', '坐下', '3', '操纵杆', '【', '】', '“', '”', '上不起', '山里娃', '为啥',
            '想造', '？', '“', '图纸', '”', '犁地', '机是', '为造', '融资', '吴中', '要造', '吊扇', '“', '”', '”',
            '专利证书', '”', '【', '】', '叫停', '场面', '失控', '8', '1', '15', '吴中', '一阵阵', '掌声', '吴中', '挥手',
            '热闹', '地问', '为啥', '”', '“', '不飞', '转圈', '”', '【', '】', '“', '吊扇', '”', '“', '吊扇', '”', '举报',
            '偷税漏税', '要挟', '敲诈', '120', '心存', '举报', '偷税漏税', '“', '120', '检举', '”', '40', '万后',
            '报警', '敲诈勒索罪', '获刑', '7', '通讯员', '金萍', '振国', '怨气', '举报', '偷税漏税', '2005', '谢某',
            '运货', '“', '运过', '货', '”', '王某', '运货', '待在家里', '谢某', '赌博', '输了钱', '敲诈', '一笔',
            '王某', '钱后', '某用', '赌债', '王某', '自首', '王某', '如意算盘', '打错', '一付', '完钱', '谢某', '报警',
            '“', '派出所', '自首', '一番', '思想斗争', '王某', '自首', '“', '车主', '瘦', '马拉', '奔驰车', '频频',
            '返修', '”', '想起', '那天', '张女士', '心有余悸', '组图', '：', '低杆', '图酷', '首页', '精彩图片', '拘',
            '小雨', '合谋', '抢走', '370', '多万美元', '带头', '行抢', '小雨', '此案', '”', '惹怒', '亲生', '上铺',
            '纸巾', '当街', '殴打', '孝女', '？', '上铺', '纸巾', '追着', '“', '啥', '竟然', '父女', '“', '20', '出头',
            '中年男子', '躲闪', '”', '“', '入室', '行窃', '小偷', '不至于', '”', '床单', '尿湿', '蓝蓝', '洗', '老太太',
            '喂饭', '”', '“', '揪', '头发', '拳头', '猛击', '脸', '”', '事发', '楼下', '狼藉', '李峰', '楼下',
            '怒目而视', '“', '进门', '“', '三四年', '”', '“', '蓝蓝的', '”', '李玉锦', '记得', '那天', '“', '一家人',
            '过得去', '自打', '家里人', '李刚', '本科毕业', '治安员', '歹徒', '捅', '谷少', '传文图', '窃贼', '捅', '”',
            '楼栋', '进村', '钻进', '小巷子', '报警', '鸣笛', '警方正', '此案', '本科毕业', '治安员', '持刀', '金店',
            '制服', '唱起', '铁窗', '泪图', '此案', '审理', '多娇', '李飞', '本报记者', '袁星', '朱蒙雪', '通讯员',
            '王莹', '”', '“', '”', '“', '”', '萌发', '”', '“', '”', '”', 'Jiayi', '”', '琴房', 'Paris', '17', '冲',
            '下河', '母女', '溺亡', '：', '8', '4', '：', '泰兴', '姚王', '“', '不要命', '地冲', '下河', '”', '发疯',
            '似地', '“', '拍醒', '”', '一前一后', '母女', '骑', '翻入', '河中', '白费', '痛哭失声', '中暑', '坠河',
            '中暑', '坠河', '通讯员', '尹有文', '吴学寨', '本报记者', '柱', '二代', '豪华', '开进', '入会', '豪门',
            '十多人', '”', '：', '“', '”', '“', '凛然', '”', '：', '炫富', '”', '”', '竞争上岗', '7', '1', '快报', '钟寅',
            '举报人', '不解', '竞岗', '为啥', '落选', '文化局', '：', '1', '：', '2', '：', '7', '1', '？', '：', '撤岗',
            '”', '2', '：', '竞岗', '为啥', '全员', '？', '3', '：', '？', '文化局', '4', '：', '？', '5', '：', '？', '几人',
            '打分', '：', '合规', '竞岗', '纪委', '百元', '请人', '扫墓', '”', '朱先生', '缺钱', '捡', '10', '失主',
            '长兴', '好样', '捡', '10', '巨款', '毫不犹豫', '物归原主', '”', '长兴', '老家', '“', '一辈子', '挣',
            '多钱', '本报', '通讯员', '徐冬梅', '本报记者', '竺军伟', '伤人', '没人管', '从轻', '以王', '涉嫌',
            '故意伤害', '刑事拘留', '检察官', '被害人', '袜子', '”', '温江区', '批捕', '产下', '4', '胳膊', '4', '条腿',
            '30', '产后', '撞人边', '撞', '喊', '轧死', '海峰', '实习生', '曹杰', '文图', '砸烂', '派出所', '接待室',
            '撞者', '：', '宝马车', '发飙', '乱撞', '姜英', '就让', '一旁', '上去', '“', '撞', '”', '撞者', '：',
            '肇事者', '派出所', '砸门', '“', '砸门', '大喊', '‘', '派出所', '咋', '’', '”', '姜先生', '：', '撞',
            '闹着玩', '？', '宝马车', '撞', '伤情', '不重', '中学教师', '茶楼', '打牌', '多嘴', '捅', '赵小洪', '持刀',
            '刺死罗某', '犯罪事实', '供认不讳', '赵小洪', '西乡县', '沙河镇', '亲戚家', '没想到', '案发', '6',
            '抓获归案', '遭拒', '诬称', '患', '昨日', '6', '菜里', '“', '艾滋', '”', '昨日', '报料', '“', '”', '陈先生',
            '陌生', '曾要', '陈先生', '鲜', '索要', '6', '陈先生', '发短信', '陈先生', '有何', '“', '陈先生', '报警',
            '高二', '发抖', '晕倒', '6', '鹏鹏', '“', '面子', '”', '“', '商场', '连遭', '诈弹', '”', '10', '9', '日晚',
            '22', '覃某', '抓获', '覃某', '犯罪事实', '供认不讳', '三口', '身份证', '春山', '“', '”', '保送', '“',
            '抗震救灾', '”', '”', '马小凤', '妈妈', '叶华蓉', '“', '小凤', '考上', '”', '团伙', '600', '斤重', '饲料',
            '压死', '恼怒', '4', '人动', '杀机', '30', '塔吊', '卡住', '1', '塔吊', '30', '呼救', '高塔', '塔吊',
            '呼救声', '揪心', '消防官兵', '恐高上', '塔吊', '救人', '获救', '号啕大哭', '感谢', '救命', '关键时刻',
            '黄强', '：', '“', '剪', '重庆晚报', '范永松', '通讯员', '肜', '愚', '同伙', '遭刺', '“', '河滨', '书报亭',
            '26', '日晚', '10', '3', '嫌疑人', '归案', '姚某', '上前', '熊某', '刺伤', '徐其勇', '砍树', '“', '砍', '”',
            '诈骗案', '”', '“', '”', '“', '公章', '”', '2010', '12', '11', '有祥', '刑事拘留', '”', '受害人', '知法',
            '办案', '民警', '”', '知法', '100', '“', '”', '宋如鹏', '法制报', '“', '胡波', '李玲', '2', '17', '没来',
            '—', '—', '襄城区', '欧庙', '李玲', '王金', '卧室', '异响', '恼怒', '李玲', '李玲', '羞愧难当', '不住',
            '地哭', '胡波', '恳请', '原谅', '谢勇', '砸', '骨折', '状告', '获赔', '昨日', '沈某', '34', '赔偿款',
            '司法鉴定', '治疗费', '8', '千至', '1', '招聘', '女狗', '聘期', '26', '昨天', '招聘', '女狗', '：', '气质佳',
            '？', '身高', '、', '品貌', '、', '26', '下岗', '？', '女尸', '手脚', '被绑', '组图', '案发现场', '疑为',
            '此案', '择优录取', '昨日', '忍无可忍', '导报', '外遇', '刘伟', '9', '带小三', '同住', '“', '5', '阿梅',
            '搬进', '小三找', '求助', '阿梅', '刘伟', '化名', '雷人', '语录', '谁错', '亏欠', '顶多', '一下', '仿真枪',
            '货刚', '到手', '刑拘', '枪刚', '杨某', '刑事拘留', '仿真枪', '刚寄到', '万源', '挡', '2', '男青年', '挥砖',
            '砸死', '砖头', '砸死', '2007', '8', '某炜', '某文', '公安机关', '抓捕归案', '本案', '审理', '爸爸', '900',
            '60', '本报记者', '梅建明', '60', '留言', '“', '奶爸', '”', '想想', '练', '哑铃', '胖乎乎', '哑铃', '呵呵',
            '”', '围观', '隔壁', '馋', '哭', '点滴', '写边', 'NB', 'S', '要换', 'M', '”', '”', '”', '”', '几度', '7',
            '旬', '期盼', '“', '力挺', '”', '”', '”', '鹅', '”', '“', '奶爸', '”', '隔壁', '馋', '哭', '牵着', '蜗牛',
            '散步', '牵', '蜗牛', '散步', '牵', '蜗牛', '散步', '？', '“', '！', '？', '”', '咦', '？', '闻到', '花香',
            '这边', '戴夫', '微风', '暴', '慢着', '！', '鸟声', '虫鸣', '满天', '星斗', '亮丽', '咦', '？', '？', '忽然',
            '莫非', '弄错', '！', '蜗牛', '牵', '散步', '隔壁', '馋', '哭', '牵', '蜗牛', '散步', '嫌犯', '盗割', '抡',
            '砍刀', '建网站', '秀', '行乞', '唐国强', '“', '威士忌', '”', '“', '”', '纸牌', '停下', '脚步', '鹅',
            '结伴', '行乞', '8', '达省', '沃', '砖', '沃', '收入丰厚', '沃', '结伴', '行乞', '讨钱', '顺便', '“', '懒',
            '乞丐', '”', '懒惰', '人过', '循规蹈矩', '”', '【', '】', '“', '讨钱', '”', '克莱格', '“', '讨钱', '”',
            '克莱格', '网络红人', '答复', '114', '砖称', '作秀', '政府网', '栏目', '着实', '吃惊', '政府网', '114', '？',
            '9', '栏目', '嘁为', '“', '114', '”', '”', '奉劝', '询问', '“', '原谅', '”', '政府办', '值班员', '：',
            '听不懂', '多多', '包涵', '砖', '评说', '作秀', '：', '潇湘晨报', '举报', '无证', '拘留', '12', '7',
            '救生衣', '私渡', '偷窃', '商场', '获刑', '6', '王某', '抑郁症', '就医', '32', '王某', '“', '稀里糊涂', '”',
            '偷', '衣服', '庭审', '王某', '认罪', '司法鉴定', '王某', '刑事责任', '公公', '锅铲', '烙', '伤续', '：',
            '2', '批捕', '谷武民', '通讯员', '案发后', '张某', '归案', '民警', '35', '民警', '报警', '报警', '果然',
            '垂垂老矣', '送出去', '老翁', '安德门', '婚介所', '征婚', '行窃', '撞', '太冤', '”', '昨日', '因雨',
            '一刻钟', '“', '全责', '”', '闻', '宏伟', '打勾', '认定书', '道路交通', '无责', '赔付', '闻', '宏伟', '闻',
            '宏伟', '调解', '择日', '：', '“', '小偷', '我会', '”', '京报', '：', '偷东西', '？', '：', '偷', '跑', '撞',
            '偷车', '可恶', '：', '赵妻', '：', '“', '想不通', '偷车', '”', '京报', '：', '？', '京报', '：', '偷车', '？',
            '赵妻', '：', '想不通', '偷车', '京报', '：', '？', '赵妻', '：', '胆小', '打架', '躲', '老家', '千余件',
            '陈灿培', '一千五', '七八千', '找期', '：', '七八千', '版面费', '一千五', '啥', '本报记者', '天宏', '实习生',
            '李景', '1', '版面费', '2', '”', '”', '”', '地说', '”', 'COUNT', '男主人', '老弟', '15', '”', '”', '婷婷',
            '民警', '拨打', '婷婷', '房主', '开了门', '”', '”', '志强', '“', '”', '那天', '”', '隔壁', '馋', '哭',
            '志强', '”', '：', '哈哈', '美女', '裸聊', '牟利', '70', '被诉', '去年', '4', '30', '肖某', '刑拘', '（',
            '王威', '通讯员', '杨舟', '）', '闪', '墓旁', '违规', '6', '10', '赶赴', '亳州市', '曹腾', '“', '十来个',
            '曹腾', '“', '”', '三幢', '16', '”', '超标', '责令', '整改', '本报', '首席记者', '宫礼', '服务队', '山难',
            '9', '10', '“', '户外运动', '长久之计', '隐患', '”', '蓝婧', '摔成', '获赔', '140', '摔成', '华华', '伤势',
            '伤残', '华华', '赔偿标准', '过低', '人身', '损害赔偿', '140', '华华', '赔偿款', '男婴', '陌生', '5', '针',
            '：', '胡鑫', '：', '：', '9', '：', '厚街', '珊', '美榄树夏', '事发', '厚街', '买水', '踪影', '好心', '纪进秀',
            '对面', '百货商店', '买水', '大意', '纪进秀', '以泪洗面', '念', '入会', '组图', '资料室', '”', '歹徒',
            '租房', '入室', '房东', '5', '8', '案情', '租房', '女房东', '营业员', '嫌疑人', '“', '嫌疑人', '预谋',
            '专找', '出租', '赌债', '任波勇', '刑事拘留', '民警', '提醒', '见义勇为', '疑犯', '堵', '家门口', '谩骂',
            '本报记者', '梁晓波', '“', '小偷', '堵', '家门口', '”', '嫌疑人', '车后', '谩骂', '没敢', '停车', '开回',
            '嫌疑人', '拘留', '？', '住址', '何人', '泄露', '？', '？', '抢钱', '连杀', '4', '抓时', '携', '“', '啥',
            '抢钱', '”', '“', '为啥', '”', '“', '想不起来', '”', '”', '4', '害', '四命', '抓时', '携', '1', '14',
            '刘忠利', '落网', '抓获', '携', '盗窃', '18', '数罪并罚', '刘忠利', '铁时', '父母亲', '探望', '抢钱',
            '被害人', '刘忠利', '他俩', '要钱', '口罩', '掉落', '灭口', '行凶', '刘忠利', '下炕', '口罩', '卧室',
            '勒死', '剃头', '扔掉', '口罩', '剃', '18', '落网', '疑点', '谋杀案', '隔壁', '馋', '哭', '一线生机', '”',
            '跳进', '进屋', '4', '多时', '公诉人', '：', '判死', '庭审', '休庭', '择日', '庭审', '刘忠利', '挑衅',
            '被害人', '王怡胜', '上铺', '纸巾', '”', '本报记者', '杨威', '假发票', '团伙', '求生存', '侦查员', '团伙',
            '假发票', '五花八门', '、', '此案', '2', '男童', '藏獒', '撕咬', '伤情', '：', '藏獒', '撕掉', '3', '抢救',
            '隔壁', '馋', '哭', '忍痛', '恶犬', '撕咬', '“', '哈哈', '别哭', '不住', '隔壁', '馋', '哭', '一摸', '大腿',
            '隔壁', '馋', '哭', '惊吓', '一声不吭', '饭店', '强忍', '“', '刮肉', '”', '之痛', '“', '换药', '10',
            '多分钟', '哭', '心疼', '”', '“', '病房', '时起', '禁养', '大型犬', '犬', '散养', '圈养', '或拴养',
            '千万富翁', '被控', '骗', '伙同', '公诉人', '：', '逼人', '欠条', '毕承', '毕力', '抓获', '毕承', '公安机关',
            '挡', '归案', '千万富翁', '摇头', '：', '”', '千万富翁', '思路清晰', '声如洪钟', '大声', '谭', '毕承',
            '顿时', '让庭下', '哗然', '毕力', '叔叔', '庭审', '休庭', '择日', '再判', '钟蓉', '民警', '掏', '200',
            '元设', '助学', '早报', '李萌', '拿出', '200', '刘毅', '直言', '心血来潮', '冲动', '举', '学业', '发愁',
            '“', '爱心', '帮困', '助学', '”', '2007', '6', '刘毅', '花园城', '刘毅', '李蕾', '800', '助学金', '”',
            '李蕾', '注资', '民警', '助学', '去年', '8', '李晴', '考取', '上海师范大学', '助学', '1000', '”', '爱心',
            '受益者', '有胆', '真好', '“', '刘毅', '积极进取', '农用车', '撞人后', '弧尸', '灭迹', '尸检', '交送',
            '宁陵县', '4', '7', '沟里', '石桥镇', '万集村', '24', '吕元伟', '所留', '死者家属', '宋某', '潜逃', '13',
            '杀人犯', '抓称', '播', '吴刚', '40', '昨日', '看守所', '本报记者', '吴刚', '吴刚', '6', '9', '前去', '”',
            '潜逃', '6', '前妻', '13', '吴刚', '化名', '刘浩', '、', '播', '京报', '：', '？', '京报', '：', '被害人', '？',
            '吴刚', '：', '忐忑', '京报', '：', '上星', '？', '京报', '：', '？', '吴刚', '：', '罪人', '京报', '：', '？',
            '吴刚', '：', '吴刚', '：', '“', '忘掉', '”', '京报', '：', '13', '出事', '？', '吴刚', '：', '出事', '阿勇',
            '孙军', '打架', '为啥', '打架', '包里', '饭桌', '手都划', '坏', '孙军', '冲过来', '捅', '京报', '：', '药',
            '？', '吴刚', '：', '事儿', '赶上', '很药', '一万个', '药都', '没用', '京报', '：', '近两年', '案发', '？',
            '吴刚', '：', '京报', '：', '真忘', '？', '吴刚', '：', '忘掉', '最惨', '痛', '京报', '：', '掩耳盗铃', '？',
            '吴刚', '：', '睡不着', '京报', '：', '13', '哪些地方', '？', '吴刚', '：', '、', '、', '京报', '：', '？', '吴刚',
            '：', '服务员', '蹦', '跶', '京报', '：', '？', '不怕', '？', '干不了', '吴刚', '：', '从零开始', '诚信',
            '客户群', '吴刚', '：', '京报', '：', '？', '吴刚', '：', '无时无刻', '打坐', '京报', '：', '冲动', '？', '吴刚',
            '：', '冲动', '嘛', '京报', '：', '踏实', '？', '吴刚', '：', '睡不着', '老家', '京报', '：', '13', '？', '？',
            '吴刚', '：', '我活', 'stock', '孤独', '思念亲人', '煎熬', '忍', '怎么办', '？', '京报', '：', '？', '吴刚',
            '：', '养父母', '过得', '怎么样', '只想', '对不起', '尽孝', '惋惜', '哭', '吴刚', '：', '四岁', '记性',
            '不大好', '京报', '：', '没想', '自首', '？', '吴刚', '：', '勇气', '挺', '侥幸', '挨', '一天天', '挨着',
            '吴刚', '：', '安安静静', '办案', '刑警', '要死', '京报', '：', '？', '吴刚', '：', '提了', '舒服', '“', '孽',
            '”', '？', '吴刚', '：', '总有', '定数', '果子', '事儿', '恶劣', '恶果', '京报', '：', '忏悔', '？', '吴刚',
            '：', '？', '灵隐寺', '住持', '冲', '笑了笑', '我念', '阿弥陀佛', '鞠', '躬', '修佛', '能车', '京报', '：',
            '？', '吴刚', '：', '我后', '京报', '：', '刘浩', '？', '吴刚', '：', '京报', '：', '吴刚', '：', '孽', '“',
            '一不小心', '走错', '”', '吴刚', '：', '罪人', '京报', '：', '13', '没想', '做些', '？', '吴刚', '：', '？',
            '吴刚', '：', '生灵', '转瞬即逝', '赎罪', '事儿', '京报', '：', '？', '吴刚', '：', '京报', '：', '？', '吴刚',
            '：', '演艺', '京报', '：', '案子', '？', '吴刚', '：', '打架', '事儿', '京报', '：', '？', '吴刚', '：', '茫然',
            '看不清', '敲', '锤子', '京报', '：', '？', '吴刚', '：', '吴刚', '：', '戏和戏', '有假', '戏有', '真戏',
            '京报', '：', '13', '年来', '假戏真做', '？', '吴刚', '：', '错事', '一不小心', '走错', '本报记者', '周亦楣',
            '幻觉', '挥', '刀伤', '挟子', '警方正', '涉嫌', '斩母', '逆子', '姓林', '、', '30', '疑', '幻觉', '挥刀',
            '伤人', '清醒', '妻', '劝服', '林妻', '接同', '鸣笛', '探望', '争手痕', '射杀', '1', '赵磊', '实习生',
            '余丞', '民警', '抓获', '但会', '尽力', '赔', '此案', '择日', '和平门', '踹', '触电', '左臂', '烧伤',
            '两败俱伤', '触电', '烧伤', '脑袋', '疼', 'CT', '姿势', '打伤', '岂能', '计谋', '碰', '嘴巴', '成全',
            '武行', '魏先生', '埋怨', '口角', '和平门', '下车时', '口角', '成全', '武行', '喊', '“', '掉下去', '”',
            '最新进展', '踹', '颅内', '另一人', '烧伤', '本报', '夜线', '简朴', '张扬', '24', '汤老', '品学兼优',
            '学子', '汤理胜', '更胜一筹', '1936', '汤理胜', '沈显', '珩', '40', '职业女性', '沈显', '珩', '利落',
            '驻沪', '沈显', '珩', '“', '一家人', '捐出', '巨款', '爱侣', '1986', '因病', '1997', '该笔', '款项', '15',
            '捐', '妈妈', '！', '”', '”', '汤朴', '语气', '”', '兴业', '小金', '”', '勉励', '学子', '发奋', '”',
            '卢湾区', '王伯南', '副理事长', '珍藏', '朝气蓬勃', '忘年交', '”', '发奋', '”', '良苦用心', '”', '汤朴',
            '10', '汤理胜', '竟是', '“', '”', '貌似', '“', '不近情理', '”', '欣然接受', '”', '汤朴', '“', '公公',
            '这儿', '30', '交了', '”', '一看', '《', '》', '“', '老爷爷', '时髦', '！', '”', '不禁', '暗自', '汤理胜',
            '老先生', '照相', '影集', '厚厚', '几十本', '感悟', '加油站', '组图', '7', '加油站', '报警', '“', '强拆',
            '”', '董', '昨天下午', '5', '强拆', '工期', 'stock', '大先', '拆后', '先建后', '”', '“', '加油站', '”',
            '这支', '青花瓷', '14', '36', '瓶身', '有青龙', '、', '祥云', '、', '波涛', '指使', '37', '捅', '组图',
            '满艳平', '落网', '拘', '案发', '：', '中年男子', '遭袭', '捅', '勘查', '：', '俱', '全身', '刀伤', '37',
            '查清', '三亚', '关系网', '：', '时遭', '歹徒', '：', '嫌疑人', '排查', '正为', '这名', '胶着', '：', '隐瞒',
            '徐某', '连忙', '打圆场', '责怪', '喝多', '餐后', '徐某', '住处', '：', '犯罪人', '侦查', '供述', '：',
            '伙同', '指使', '行凶', '泄愤', '下车', '争吵', '：', '悬赏', '行凶', '“', '”', '：', '歹徒', '撕票', '敲诈',
            '150', '一番', '杨某', '小海', '嫌疑人', '杨某', '、', '马某', '刑事拘留', '染发剂', '皮肤', '肿胀', '眼皮',
            '外凸', '组图', '染发剂', '棕色', '头发', '肿胀', '”', '图酷', '首页', '精彩图片', '男扮女装', '入室',
            '行窃', '录', '作案', '盗窃', '涉案', '万余元', '刑事拘留', '“', '紧身裤', '”', '聪明', '男扮女装', '行窃',
            '盗窃', '刑拘', '李某', '因涉嫌', '盗窃罪', '刑事拘留', '文图', '王晓强', '本报', '通讯员', '梁铁君',
            '杨光', '8', '讨回', '23', '农民工', '欠薪', '本报记者', '红阳', '”', '信阳市', '监督局', '罗传亮', '2001',
            '159', '务工', '矽肺病', '这起', '刺痛', '信阳市', '、', '讨薪', '走极端', '“', '工钱', '农民工', '过激',
            '”', '陈民说', '“', '‘', '’', '输出地', '输入地', '农民工', '”', '陈民', '”', '陈民', '意味深长', '谎称',
            '练胆', '10', '柑橘', '柑橘', '10', '？', '99', '忙', '20', '柑橘', '…', '…', '”', '200', '米外', '地基',
            '快餐店', '朱先生', '朱先生', '掏', '10', '柑橘', '30', '米外', '拦', '柑橘', '朱先生', '地基', '快餐店',
            '“', '婉拒', '”', '班长', '朱先生', '碚', '派出所', '防骗', '》', '》', '碚', '派出所', '）', '同情心', '行骗',
            '朱昕勤', '实习生', '裴昌涛', '63', '冒充', '女病人', '8', '变态', '赌球', '团伙', '赌博', '参赌', '获刑',
            '赌球', '团伙', '投注', '4300', '余万元', 'D', '参赌', '无业人员', '辉元哀', '赌球', '可判', '10', '六旬',
            '农妇', '50', '石雕', '雕塑系', '邀其办', '农家院', '坝成', '“', '”', '“', '画画', '说起', '切割机', '”',
            '邬良英', '杨科芹', '”', '做成', '300', '切割机', '“', '雕塑系', '邀', '“', '震撼', '刘景活', '“', '雕塑家',
            '（', '《', '》', '）', '脱光', '搜身', '脱光', '唐国强', '昨日', '拨打', '王一', '接听', '揭查', '损', '内幕',
            '欧尚', '防损部', '大堂', '店长', '防损', '防', '损耗', '损耗', '街办', '侵权者', '举报', '搜身', '报警',
            '消委', '：', '侵权', '消委', '：', '944', '“', '太过分', '”', '37', '小偷', '猖獗', '364', '方应', '记者席',
            '王敏成', '实习生', '郜筱', '回放', '商城', '精装', '17500', '房源', '50', '套图', '商城', '相册', '户型',
            '样板间', '地图搜索', '商城', '均价', '17500', '平米', '在售', '户型', '170', '、', '190', '平米', '三居',
            '精装修', '现房', '房源', '50', '远洋', '万和城', '禅学', '房产', '：', '购房', '付款', '99', '2012', '查询',
            '六环路', '仅供参考', '发文', '：', '15', '文于祥明', '《', '》', '“', '”', '“', '宽限期', '”', '15', '”',
            '执法局', '”', '星河湾', '8', '8', '：', '开盘', '成交', '40', '郝倩', '“', '40', '成交', '成交', '星河湾',
            '”', '副总裁', 'CBN', '”', '星河湾', '黄文仔', 'CBN', '65', '豪宅', '肾上腺素']


def get_access_token():
    """
    使用 API Key，Secret Key 获取access_token，替换下列示例中的应用API Key、应用Secret Key
    """
    AppID = 44592571
    ApiKey = 'tEUIklndR5n0EtmZBCTXGIMZ'
    SK = 'lUKitI49tkevMOiMl9NUIP6kpA7osNxN'

    url = f"https://aip.baidubce.com/oauth/2.0/token?grant_type=client_credentials&client_id={ApiKey}&client_secret={SK}"

    payload = json.dumps("")
    headers = {
        'Content-Type': 'application/json',
        'Accept': 'application/json'
    }

    response = requests.request("POST", url, headers=headers, data=payload)
    return response.json().get("access_token")


def main(word):
    # url = "https://aip.baidubce.com/rpc/2.0/ai_custom/v1/wenxinworkshop/chat/completions_pro?access_token=" + get_access_token()
    url = 'https://aip.baidubce.com/rpc/2.0/ai_custom/v1/wenxinworkshop/chat/eb-instant?access_token=' + get_access_token()
    payload = json.dumps({
        "messages": [
            {
                "role": "user",
                "content": f"""
                用'{word}'这个词语造一个25句子，要求如下：
                1.你只需要输出这25个句子就行
                2.句子不能重复，越多样化越好
                3.给你的词汇不能只在开头或者结尾出现，需要在句子中间出现
                """
            }
        ]
    })
    headers = {
        'Content-Type': 'application/json'
    }

    response = requests.request("POST", url, headers=headers, data=payload)
    with open("./LLM_dataGenerate.txt", "a", encoding='utf-8') as f:
        res = eval(response.text.replace("false", 'False').replace("true", 'True'))
        f.write(res['result'])
    # print(res['result'])


if __name__ == '__main__':
    res = []
    summaryDict = {}
    for i in tqdm.tqdm(wordList, desc='处理词语中'):
        with open("./LLM_dataGenerate.txt", "r", encoding='utf-8') as f:
            cont = f.read()
            if cont.count(str(i)) not in summaryDict:
                summaryDict[cont.count(str(i))] = 0
            summaryDict[cont.count(str(i))] += 1
            if cont.count(str(i)) >= 15:
                # print(f"word:{i} count:{cont.count(str(i))}")
                res.append(int(cont.count(str(i))))
                continue
            print(f'word: {i} count:{cont.count(str(i))} processing')
        # main(i)
    print(sum(res)/len(res), min(res), max(res))
    pprint.pprint(summaryDict)